


console.log(Number.isNaN(+'.'))
console.log(Number.isNaN(+'1'))


let indexList = []
const charCodeOfA = 'A'.charCodeAt(0);
for (let i = 0; i < 26; i++) {
  indexList.push(String.fromCharCode(charCodeOfA + i));
}




/**
 * 姓氏映射表
 */
 const lastNameMap = new Map()

 const capitalization = str => str.toUpperCase()

 lastNameMap.set('A', ['阿', '爱', '艾', '安', '奥', '鳌', '敖', '爱新觉罗'])

 lastNameMap.set('B', ['白', '包', '毕', '鲍', '柏', '卜', '边', '卞', '班', '巴', '薄', '贝', '宾', '贲', '步', '邴', '暴', '别', '伯', '布', '宝', '保', '百', '闭', '薜', '本', '拜', '波', '摆', '秘', '博', '补', '北', '部', '把', '板', '八', '比', '冰', '坂', '不', '卑', '邦', '表', '彪', '崩', '滨', '兵', '孛', '拨', '杓', '帮', '捌', '碧', '拔', '浜', '霸', '办', '佈', '彼', '白玛', '簿', '阪', '斌', '扁', '必', '丙', '蚌', '百里', '坝', '标', '奔', '斑', '半', '鮑', '苪', '栢', '芭', '補', '佰', '泊', '彬', '叭', '便', '扒', '歩', '炳', '葆', '伴', '白马', '並', '勃', '秉', '濱', '备', '豹', '汴', '桮', '辈', '悲', '并', '播', '变', '倍', '棒', '弼', '壁', '笔', '弁', '渤', '柄', '蘖', '亳', '苞', '报', '杯', '甭', '玻', '鞭', '杷', '般', '背', '邠', '蓓', '榜', '饱', '瀑', '碑', '菠', '捕', '辟', '埔', '仈', '败', '傍', '雹', '抱', '邶', '庇', '弊', '币', '遍', '辨', '辩', '禀', '钵', '搏', '悖', '哺', '莾', '妣', '槟', '剥', '祕', '蔽', '镖', '幷', '峇', '茇', '罢'])

 lastNameMap.set('C', ['陈', '曹', '蔡', '程', '崔', '常', '柴', '成', '查', '岑', '车', '褚', '丛', '迟', '池', '楚', '昌', '储', '晁', '初', '谌', '束', '充', '从', '才', '巢', '苍', '长', '次', '藏', '操', '畅', '种', '茶', '仓', '慈', '朝', '春', '崇', '寸', '承', '淳', '査', '村', '苌', '措', '赤', '丑', '产', '淳于', '单于', '揣', '川', '楮', '钏', '催', '晨', '钞', '财', '城', '此', '彩', '唱', '冲', '啜', '采', '镡', '察', '草', '重', '潮', '出', '菜', '闯', '宠', '瘳', '炊', '超', '尘', '侴', '陳', '翠', '禅', '茌', '除', '呈', '爨', '蓸', '鉏', '串', '辰', '称', '持', '曺', '婵', '叱', '尺', '缠', '存', '蚩', '层', '策', '船', '残', '错', '抄', '测', '昶', '刺', '吹', '敕', '乘', '沉', '础', '醋', '祡', '兹', '臣', '诚', '场', '吃', '处', '傳', '创', '雏', '聪', '澄', '搓', '椿', '耻', '差', '灿', '促', '驰', '沖', '長', '槽', '椎', '澈', '床', '車', '衬', '茨', '秤', '粗', '撤', '戳', '弛', '撮', '趁', '阐', '拆', '纯', '橙', '塍', '擦', '璨', '菖', '尝', '郴'])

 lastNameMap.set('D', ['邓', '董', '杜', '丁', '段', '戴', '窦', '党', '刁', '代', '狄', '都', '东', '达', '邸', '堵', '豆', '刀', '但', '多', '待', '旦', '德', '大', '顿', '端', '道', '笪', '淡', '丹', '底', '冬', '斗', '朵', '当', '敦', '逮', '定', '登', '地', '迪', '独', '夺', '的', '答', '岛', '渡', '得', '第', '稻', '典', '懂', '佃', '岱', '囤', '迭', '端木', '苳', '电', '打', '度', '蕫', '顶', '奠', '黛', '栋', '歹', '弟', '冻', '等', '东方', '帝', '兑', '荻', '对', '洞', '灯', '东郭', '堤', '东门', '铎', '贷', '敌', '嶋', '堆', '殿', '鄧', '荡', '陡', '苖', '郸', '棣', '带', '东野', '雕', '耑', '督', '读', '笃', '牒', '档', '第五', '東', '胆', '徳', '滇', '蒂', '锻', '短', '担', '傣', '队', '断', '砀', '点', '侗', '堕', '递', '丼', '甸', '肚', '掇', '呆', '动', '惰', '笛', '鼎', '逗', '搭', '到', '钓', '吨', '耽', '低', '朶', '袋', '导', '涤', '店', '垫', '谛', '独孤', '抵', '儋', '氐', '仃', '墩', '妲', '刟', '琱', '盾', '荅', '凳', '娣', '钿', '貂', '吊', '兜', '渎', '碓', '段干'])

 lastNameMap.set('E', ['鄂', '俄', '额', '二', '恩', '尔', '而', '儿', '耳', '娥', '児', '哦', '峎', '饿', '峨', '婀', '厄', '恶', '讹', '鹗', '鹅', '噩', '谔', '贰', '鳄', '咢', '陑', '呝', '吪', '扼', '阨', '弍', '駬', '莪', '屙', '腭', '愕', '鈋', '崿', '堨', '轭', '垩', '妸', '萼', '娿', '迩', '尒', '珥', '洱', '耏', '锷', '阏', '蛾', '佮', '鵞', '姶', '遏', '嶭', '阏胡', '鄂卓', '恩昆', '鄂岳', '鄂屯', '鄂同', '恩扎', '尔绵', '妸荷', '耏门', '娥陵', '尔朱', '额色', '俄来', '鄂通', '鄂秦', '鄂纳', '俄日', '俄琪', '俄尼', '俄嫩', '俄木', '俄牟', '俄莫', '俄觉', '阿难', '阿郎', '阿刺', '鄂托', '鄂诺', '俄托', '俄延', '鄂囉', '鄂济', '遏捻', '遏罗', '额珠', '额哲', '额伊', '额托', '鄂拉', '额鲁', '额卜', '鹅尼', '峨尔', '鄂嫩'])

 lastNameMap.set('F', ['冯', '范', '付', '方', '傅', '樊', '符', '房', '费', '封', '丰', '伏', '富', '凤', '酆', '宓', '凡', '扶', '法', '藩', '奉', '俸', '福', '甫', '蜂', '番', '逢', '飞', '浮', '风', '府', '芳', '洑', '斐', '放', '负', '饭', '附', '非', '佛', '发', '辅', '弗', '苻', '枫', '服', '峰', '夫', '菲', '阜', '复', '梵', '沣', '冨', '防', '繁', '抚', '纺', '肥', '坟', '峯', '副', '芙', '赴', '巷', '锋', '燓', '釜', '翻', '缶', '笵', '飯', '邡', '芬', '剻', '燔', '反', '粉', '幅', '斧', '分', '坊', '拂', '妇', '蕃', '扉', '孚', '阀', '罚', '焚', '汾', '敷', '枋', '蜚', '芾', '虑', '榑', '缚', '鄷', '烽', '仿', '妃', '伐', '璠', '奜', '棼', '奋', '涪', '蘩', '返', '绯', '匐', '俯', '脯', '赋', '覆', '贩', '飌', '怫', '棐', '猆', '烦', '蝮', '腹', '鲋', '呒', '父', '鬴', '澓', '咈', '吩', '桴', '刜', '阝', '凢', '俌', '俛', '匪', '虙', '辐', '讽', '拊', '罘', '黻', '绂', '访', '纷', '昐', '肺', '淝', '昉', '鲂', '泛', '汎', '氾', '伕', '蠭'])

 lastNameMap.set('G', ['郭', '高', '顾', '龚', '关', '葛', '耿', '管', '甘', '谷', '宫', '古', '桂', '巩', '苟', '干', '盖', '国', '官', '郜', '公', '戈', '贡', '弓', '广', '勾', '辜', '格', '庚', '过', '果', '嘎', '尕', '刚', '缑', '光', '更', '归', '贵', '淦', '呙', '虢', '个', '杲', '根', '芶', '皋', '贯', '冮', '革', '冈', '句', '钢', '拱', '冠', '滚', '工', '供', '各', '公孙', '岗', '哏', '髙', '閤', '共', '岡', '改', '股', '观', '公冶', '鬲', '给', '恭', '雇', '鼓', '阁', '固', '锅', '垢', '公羊', '构', '沟', '歌', '噶', '公西', '姑', '刮', '谷梁', '公良', '笱', '龟', '宮', '皈', '棍', '瓜', '関', '镐', '哥', '艮', '纲', '功', '廣', '敢', '港', '昋', '故', '咼', '溝', '洼', '嘠', '挂', '攻', '鬼', '佫', '跟', '灌', '閣', '罡', '糕', '估', '雊', '広', '菇', '馆', '告', '傀', '衮', '够', '规', '杠', '耕', '卦', '菰', '杆', '赶', '圭', '赓', '涡', '丐', '狗', '缸', '莞', '割', '凎', '稿', '汞', '孤', '竿', '感', '赣', '炅', '睾', '旮', '亘', '僱', '羔', '妫', '瑰', '闺', '晷', '穀梁'])

 lastNameMap.set('H', ['黄', '胡', '何', '韩', '侯', '贺', '郝', '洪', '霍', '华', '候', '惠', '杭', '和', '花', '赫', '宦', '扈', '滑', '弘', '怀', '红', '后', '衡', '桓', '呼', '哈', '湖', '海', '户', '黑', '郈', '虎', '郇', '化', '回', '皇', '完', '火', '行', '汉', '河', '蒿', '浩', '环', '厚', '宏', '槐', '黃', '辉', '合', '昊', '还', '慧', '淮', '恒', '寒', '喊', '皇甫', '忽', '撖', '奂', '罕', '横', '会', '好', '荒', '浣', '荷', '浑', '禾', '鸿', '亨', '晃', '矦', '航', '豪', '憨', '瑚', '伙', '狐', '斛', '赫连', '鹤', '呼延', '画', '欢', '翰', '灰', '号', '汇', '翚', '後', '阍', '豁', '恵', '货', '虹', '韓', '轷', '混', '含', '换', '黒', '耗', '汗', '皓', '很', '烘', '橄', '夯', '焕', '琥', '蕙', '邯', '害', '毫', '猴', '郃', '闬', '护', '乎', '核', '沪', '亥', '恢', '瀚', '获', '桦', '活', '划', '壶', '挥', '钬', '褐', '鍭', '葫', '毁', '涵', '幻', '捍', '泓', '珲', '徽', '诃', '阖', '煌', '潢', '璜', '苄', '绘', '卉', '函', '呵', '曷', '寰', '晖', '祸', '恨', '互'])

 lastNameMap.set('J', ['蒋', '姜', '金', '贾', '江', '季', '简', '纪', '焦', '靳', '吉', '强', '姬', '揭', '景', '鞠', '荆', '井', '计', '冀', '嵇', '家', '晋', '汲', '经', '敬', '郏', '居', '蓟', '暨', '矫', '加', '巨', '籍', '靖', '琚', '蹇', '菅', '建', '集', '戢', '久', '甲', '将', '静', '颉', '降', '及', '嘉', '杰', '介', '监', '具', '接', '角', '见', '教', '坚', '九', '剧', '酒', '缴', '徼', '隽', '交', '节', '翦', '觉', '基', '今', '佳', '菊', '荚', '俊', '且', '稽', '鉴', '俱', '夹', '尖', '雎', '咎', '京', '剑', '竭', '结', '君', '荐', '机', '祭', '剪', '锦', '举', '军', '渐', '积', '伽', '吉克', '纠', '莒', '娇', '进', '晶', '矍', '净', '津', '继', '蔣', '间', '玖', '竟', '近', '娟', '界', '几', '荊', '寄', '吉木', '际', '藉', '济', '夹谷', '箭', '矶', '皆', '捷', '记', '蔄', '戒', '掲', '嵆', '皎', '榎', '健', '楫', '决', '磯', '伋', '绞', '圈', '兼', '笈', '郊', '棘', '驹', '茍', '臼', '叫', '均', '橘', '厥', '賈', '旧', '局', '洁', '鹫', '婧', '街', '借', '截'])

 lastNameMap.set('K', ['孔', '康', '柯', '匡', '寇', '邝', '阚', '况', '空', '夔', '隗', '蒯', '亢', '旷', '开', '克', '库', '卡', '可', '凯', '考', '奎', '郐', '科', '苦', '看', '堀', '宽', '魁', '肯', '客', '蒉', '口', '坎', '夸', '快', '葵', '抗', '昆', '阔', '扣', '坤', '叩', '蔻', '喀', '堪', '宼', '轲', '勘', '矿', '坑', '枯', '课', '靠', '伉', '冦', '哭', '桧', '逵', '晆', '廓', '闞', '窠', '砍', '侃', '苛', '珂', '垮', '炕', '贶', '刻', '楷', '框', '狂', '亏', '刊', '渴', '糠', '铿', '酷', '筐', '逊', '恺', '篑', '控', '括', '崑', '衎', '款', '窥', '困', '琨', '扩', '巙', '睽', '揆', '闚', '纩', '姱', '侉', '阃', '堃', '崐', '裈', '轗', '邟', '疴', '欵', '髠', '敤', '壸', '歀', '濶', '髡', '窟', '彄', '恐', '涳', '恪', '岢', '鄡', '阬', '匮', '溃', '锟', '餽', '暌', '鄈', '悝', '圹', '璯', '哙', '侩', '渴俟', '渴烛', '克哷', '克其', '克惹', '克音', '可地', '渴侯', '渴汉', '渴单', '可悉', '可奚', '可沓', '可频', '可逻', '可黎', '克因', '空侯', '孔当', '坤奇', '揆龙', '奎苏', '库姆', '库门', '库汉'])

 lastNameMap.set('L', ['李', '刘', '林', '罗', '梁', '吕', '卢', '陆', '廖', '雷', '龙', '黎', '赖', '骆', '鲁', '柳', '蓝', '芦', '兰', '路', '凌', '冷', '连', '郎', '栾', '娄', '栗', '练', '楼', '乐', '劳', '蔺', '廉', '厉', '利', '隆', '逯', '来', '郦', '鹿', '禄', '拉', '历', '雒', '令狐', '良', '伦', '里', '洛', '粱', '励', '朗', '令', '老', '勒', '闾', '留', '律', '吝', '力', '丽', '列', '喇', '粮', '立', '类', '零', '离', '郞', '落', '六', '腊', '理', '礼', '录', '莲', '稂', '浪', '荔', '联', '侣', '流', '寥', '漏', '刘付', '铃', '露', '陇', '灵', '莱', '领', '亮', '剌', '率', '论', '篮', '疗', '聊', '呂', '玲', '炼', '岺', '梨', '蕾', '琳', '络', '陵', '另', '垄', '濑', '闾丘', '庐', '绿', '吏', '旅', '笠', '楞', '莉', '劉', '梁丘', '竜', '苓', '陸', '倮', '镰', '拦', '泠', '量', '炉', '泷', '临', '伶', '辽', '盧', '劣', '岭', '菱', '滝', '寮', '羅', '淩', '萝', '蓼', '赁', '累', '磊', '了', '孪', '懒', '岚', '賴', '滦', '耒', '澜', '豊', '朿', '泸', '瀧', '犁', '鈴'])

 lastNameMap.set('M', ['马', '孟', '毛', '莫', '麦', '苗', '梅', '牟', '闵', '穆', '蒙', '缪', '米', '茅', '满', '麻', '明', '慕', '门', '糜', '木', '牧', '母', '买', '茆', '么', '冒', '沐', '密', '美', '卯', '玛', '梦', '某', '敏', '磨', '墨', '弥', '弭', '繆', '莽', '曼', '默', '民', '咪', '牡', '妙', '幕', '勉', '闽', '名', '庙', '妹', '枚', '芈', '谬', '摩', '祃', '迈', '慕容', '茂', '忙', '芒', '睦', '貌', '姆', '鸣', '目', '漫', '万俟', '貊', '杩', '闷', '末', '峁', '们', '猫', '没', '贸', '邙', '馬', '卖', '模', '每', '咩', '暮', '猛', '矛', '绵', '面', '味', '勐', '妈', '茉', '麋', '摸', '吗', '蜜', '麥', '茫', '迷', '劢', '昴', '糸', '萌', '棉', '靡', '免', '漠', '铭', '募', '庬', '眉', '盟', '玫', '命', '祢', '缅', '慢', '旻', '蔓', '墓', '码', '秒', '茗', '亩', '骂', '描', '懋', '沫', '陌', '谟', '楳', '膜', '谋', '蛮', '蟒', '媚', '洣', '眠', '冕', '淼', '邈', '灭', '秣', '瞑', '杪', '珉', '苜', '傌', '泯', '觅', '蔑', '冥', '抹', '蔴', '埋', '佅', '樠', '瞒'])

 lastNameMap.set('N', ['倪', '牛', '聂', '宁', '农', '南', '钮', '那', '能', '乜', '佴', '尼', '年', '娜', '纳', '念', '努', '赧', '甯', '粘', '侬', '乃', '娘', '闹', '内', '诺', '泥', '铙', '妮', '你', '奈', '奴', '楠', '曩', '纽', '怒', '拿', '囊', '脑', '喃', '鸟', '讷', '聶', '弄', '南宫', '辇', '南门', '尼玛', '挪', '男', '难', '妞', '女', '呢', '浓', '耐', '絮', '碾', '寗', '伲', '扭', '柰', '糯', '孽', '瑙', '奶', '淖', '籾', '凝', '耨', '哪', '恼', '霓', '燃', '捏', '臬', '嫩', '坭', '艿', '孬', '匿', '孥', '逆', '陧', '睨', '呐', '杻', '郍', '懦', '捺', '嬲', '槈', '孼', '黏', '挠', '鼐', '寍', '揑', '您', '拏', '哖', '伱', '獳', '迺', '挐', '囡', '弇', '湳', '峱', '郳', '齧', '涅', '掜', '尿', '孃', '溺', '尼者', '尼珠', '泥孰', '泥中', '倪属', '粘哥', '粘割', '粘合', '粘葛', '尼沙', '尼南', '尼里', '喃葛', '弇岗', '囊知', '讷迪', '讷都', '讷哷', '讷延', '能能', '尼佳', '鸟浴', '聂米', '蘖齧', '侬多', '侬商', '弄拉', '奴丹', '努噜', '虐姆', '诺护', '诺罗', '诺延', '纽纽', '纽赫', '宁玻', '宁佳', '宁姆', '牛蟜'])

 lastNameMap.set('O', ['欧', '欧阳', '区', '偶', '殴', '藕', '鸥', '瓯', '噢', '沤', '讴', '耦', '呕', '偶能', '偶罗', '欧冶', '欧琪', '欧其', '欧羊', '欧俟', '欧侯', '偶琪'])

 lastNameMap.set('P', ['彭', '潘', '庞', '裴', '蒲', '朴', '普', '浦', '平', '皮', '濮', '逄', '蓬', '盘', '泮', '帕', '朋', '濮阳', '瓮', '排', '片', '骈', '攀', '邳', '盆', '鹏', '培', '溥', '品', '厐', '怕', '飘', '批', '跑', '胖', '偏', '澎', '苹', '裵', '牌', '莆', '坡', '爬', '坪', '葡', '扑', '迫', '仆', '颇', '派', '棚', '粕', '泡', '萍', '旁', '冸', '沛', '佩', '铺', '盼', '破', '配', '票', '评', '璞', '疋', '捧', '凭', '漂', '尨', '畔', '炮', '菩', '拍', '郫', '乒', '葩', '贫', '磐', '叛', '篇', '瓢', '剖', '瓫', '蟠', '胚', '喷', '裨', '匹', '聘', '郱', '篷', '籓', '珮', '萠', '礟', '諀', '泙', '坌', '判', '圃', '裒', '叵', '緐', '泼', '缾', '貔', '鉼', '攴', '哱', '疲', '萢', '鞄', '凴', '縏', '韸', '缻', '瓶', '洴', '赔', '掊', '匏', '袍', '庖', '槃', '棑', '俳', '婆', '鄱', '丕', '棓', '屏', '牝', '频', '骠', '骗', '罴', '毗', '披', '伾', '倗', '芃', '婆衍', '破丑', '仆骨', '仆阑', '仆散', '蒲察', '蒲诃', '婆实', '婆施', '婆罗', '匹娄', '疋娄'])

 lastNameMap.set('Q', ['秦', '邱', '覃', '钱', '齐', '乔', '祁', '曲', '屈', '全', '戚', '瞿', '仇', '丘', '权', '阙', '漆', '裘', '亓', '卿', '璩', '青', '渠', '其', '綦', '谯', '郄', '秋', '钦', '庆', '千', '杞', '琼', '企', '起', '奇', '求', '切', '清', '潜', '七', '群', '羌', '前', '穷', '乾', '确', '苘', '骞', '祈', '柒', '却', '岂', '乞', '钤', '取', '启', '蘧', '桥', '雀', '浅', '期', '琴', '麴', '岐', '勤', '墙', '泉', '恰', '巧', '樵', '卻', '芩', '轻', '麹', '谦', '倾', '邛', '侨', '锜', '茜', '漆雕', '茄', '曲木', '錡', '欠', '萩', '朐', '迁', '亲', '琪', '契', '去', '芹', '顷', '旗', '钳', '怯', '蔳', '气', '麒', '癿', '仟', '瞧', '阕', '啟', '斉', '晴', '歧', '犬', '區', '琦', '倩', '崎', '橋', '祺', '斳', '黔', '请', '俟', '沁', '趋', '劝', '芊', '妾', '汽', '淇', '籧', '绮', '亐', '懃', '骑', '畦', '酋', '缺', '妻', '示', '情', '蕲', '牵', '枪', '荞', '欺', '禽', '棋', '耆', '俏', '颀', '荃', '趄', '擎', '栖', '硗', '拳', '铅', '器', '洽', '阡', '侵', '虬', '亓官'])

 lastNameMap.set('R', ['任', '饶', '冉', '阮', '茹', '芮', '容', '融', '戎', '荣', '汝', '仁', '人', '热', '日', '瑞', '若', '如', '让', '闰', '肉', '染', '绕', '柔', '肜', '壬', '润', '茸', '然', '惹', '绒', '软', '穰', '壤驷', '壤', '入', '褥', '认', '蓉', '锐', '忍', '宍', '荏', '娆', '苒', '儒', '榕', '韧', '冗', '仍', '弱', '濡', '扰', '刃', '偌', '纫', '辱', '蕊', '髯', '乳', '閠', '嵘', '熔', '偄', '傉', '溽', '蚋', '礽', '冄', '葇', '喏', '蚦', '鄀', '肰', '攘', '妊', '扔', '茙', '狨', '孺', '鄏', '蓐', '荣启', '荣普', '茙春', '日律', '仁佳', '热玛', '惹几', '惹各', '若罗', '若久', '荣姓', '容中', '如定', '若姆', '蠕蠕', '傉檀', '儒李', '茹茹', '茹罗', '如雍', '如罗', '如稽', '如嵇', '茙眷', '若干', '穰结', '荣成', '荣伯', '肜鱼', '肜城', '戎子', '戎州', '戎胥', '日中', '若敖', '扰龙', '染女', '荣公', '荣锜', '荣叔', '冉拉', '冉夫', '仁曾', '芮伯', '汝斤', '孺子', '茹莲', '茹连', '融夷', '容城', '容成', '冉相'])

 lastNameMap.set('S', ['孙', '宋', '苏', '沈', '石', '史', '邵', '施', '申', '尚', '单', '舒', '盛', '时', '司', '沙', '隋', '商', '师', '桑', '佘', '索', '水', '松', '山', '寿', '帅', '宿', '双', '粟', '韶', '殳', '慎', '厍', '莘', '上官', '斯', '赏', '上', '税', '侍', '赛', '生', '萨', '司马', '随', '眭', '市', '三', '折', '思', '圣', '锁', '睢', '撒', '闪', '绳', '森', '申屠', '胜', '四', '陕', '树', '神', '所', '色', '叔', '绍', '疏', '莎', '佀', '是', '善', '伞', '剡', '司徒', '首', '省', '舍', '顺', '社', '拾', '杉', '释', '散', '卲', '参', '淑', '速', '仕', '矢', '匙', '世', '寺', '少', '岁', '深', '术', '厦', '素', '洒', '召', '守', '辻', '僧', '叁', '塞', '鄯', '说', '耍', '姒', '曙', '书', '什', '十', '索朗', '士', '扫', '受', '司空', '嵩', '珊', '穗', '硕', '尙', '司寇', '梭', '送', '晒', '柿', '啥', '戍', '劭', '手', '笙', '实', '算', '审', '室', '扇', '适', '诗', '薮', '身', '涉', '摄', '砂', '刷', '升', '栓', '勝', '肃', '射', '榊', '丝', '霜', '涩', '蘇', '孫', '数'])

 lastNameMap.set('T', ['唐', '田', '谭', '陶', '汤', '涂', '童', '滕', '谈', '佟', '屠', '邰', '仝', '通', '腾', '檀', '铁', '台', '庹', '太', '拓', '同', '塔', '图', '天', '潭', '土', '凃', '妥', '藤', '泰', '特', '脱', '钭', '帖', '托', '吐', '提', '太叔', '遆', '陀', '他', '徒', '投', '澹', '庭', '桃', '拖', '团', '题', '吞', '淘', '澹台', '它', '套', '樋', '添', '沓', '堂', '縢', '塘', '头', '倘', '笹', '佗', '畑', '体', '贴', '桐', '郯', '涛', '屯', '筒', '坦', '她', '禢', '坛', '推', '彤', '驼', '婷', '铜', '梯', '町', '途', '褟', '肽', '兔', '塗', '湯', '听', '甜', '譚', '廷', '棠', '榻', '茼', '突', '弹', '烫', '昙', '糖', '条', '统', '汀', '趟', '厅', '滩', '逃', '桶', '退', '潼', '僮', '调', '苔', '炭', '太史', '秃', '荼', '抬', '挑', '橐', '填', '橝', '停', '踏', '替', '恬', '暾', '胎', '缇', '惕', '亭', '塌', '韬', '讨', '跳', '偷', '透', '驮', '探', '逖', '啼', '摊', '杔', '佟佳', '邒', '拓跋', '虅', '籐', '坨', '溻', '蹋', '骀', '汰', '痰', '歎', '搪', '淌', '傥'])

 lastNameMap.set('W', ['王', '吴', '魏', '汪', '韦', '武', '伍', '万', '温', '文', '翁', '卫', '邬', '巫', '危', '闻', '乌', '蔚', '尉', '毋', '沃', '位', '宛', '未', '旺', '仵', '无', '望', '吾', '伟', '问', '五', '瓦', '威', '巍', '维', '物', '委', '汶', '兀', '晚', '外', '务', '尾', '丸', '弯', '午', '卧', '哇', '为', '闻人', '雯', '梶', '峗', '梧', '碗', '窝', '唯', '巫马', '勿', '微', '网', '湾', '枉', '稳', '吳', '我', '娃', '慰', '挖', '仼', '完颜', '渭', '皖', '忘', '歪', '屋', '忤', '苇', '溫', '往', '罔', '窪', '误', '鄔', '玩', '婉', '玮', '悟', '菀', '隈', '渥', '炜', '惟', '纬', '舞', '莴', '薇', '围', '戊', '甕', '倭', '斡', '伪', '胃', '违', '芜', '阌', '衞', '帷', '王孙', '娲', '亡', '握', '晤', '雾', '迕', '俉', '桅', '微生', '顽', '谓', '蕹', '悮', '佤', '涴', '娩', '腕', '忹', '琞', '萎', '嵬', '寪', '蒍', '芛', '骪', '骫', '畏', '纹', '偓', '呜', '诬', '郚', '浯', '杌', '寤', '隖', '潕', '窊', '嗢', '翫', '尫', '尪', '椲', '舋', '橆'])

 lastNameMap.set('X', ['徐', '谢', '许', '肖', '夏', '熊', '薛', '萧', '向', '邢', '辛', '冼', '解', '项', '席', '宣', '奚', '胥', '西', '习', '郗', '相', '荀', '修', '幸', '咸', '鲜', '须', '信', '轩', '刑', '玄', '小', '续', '忻', '先', '晓', '禤', '雪', '新', '香', '县', '寻', '夏侯', '秀', '线', '吁', '喜', '星', '兴', '校', '袭', '乡', '贤', '仙', '呷', '希', '俆', '孝', '学', '下', '欣', '锡', '绪', '旭', '雄', '洗', '息', '旋', '轩辕', '顼', '葸', '羡', '缐', '姓', '效', '筱', '郤', '心', '杏', '昔', '细', '溪', '笑', '偰', '宪', '祥', '郉', '铉', '霞', '闲', '隰', '穴', '鑫', '潇', '鲜于', '箫', '翔', '侠', '血', '篠', '霰', '湘', '畜', '消', '协', '線', '西门', '莦', '形', '佡', '系', '象', '戌', '許', '伭', '旬', '写', '现', '选', '倖', '献', '休', '显', '兄', '犀', '昕', '些', '相里', '夕', '馨', '襄', '榭', '霄', '陷', '虾', '序', '謝', '懈', '宵', '叙', '脇', '稀', '斜', '踅', '需', '熙', '萱', '邪', '箱', '薪', '効', '想', '胁', '限', '析', '苋', '巽', '勋', '狭'])

 lastNameMap.set('Y', ['杨', '袁', '余', '于', '叶', '姚', '尹', '闫', '严', '阎', '殷', '易', '颜', '岳', '顔', '俞', '游', '尤', '喻', '应', '阳', '晏', '郁', '虞', '伊', '燕', '原', '禹', '云', '苑', '仰', '鄢', '羊', '元', '衣', '雍', '於', '岩', '阴', '养', '玉', '羿', '益', '越', '由', '银', '冶', '宇', '庾', '尧', '延', '鱼', '扬', '依', '英', '永', '要', '亚', '言', '央', '员', '仪', '恽', '贠', '印', '运', '远', '义', '焉', '弋', '牙', '野', '勇', '雅', '药', '拥', '宜', '彦', '犹', '矣', '遇', '月', '院', '营', '艳', '奕', '乙', '裔', '业', '宴', '有', '油', '攸', '约', '蚁', '悦', '一', '鄞', '盈', '友', '夷', '洋', '幺', '源', '雨', '郧', '音', '貟', '羽', '韵', '秧', '烟', '怡', '炎', '夜', '押', '翼', '也', '迂', '迎', '允', '移', '庸', '扆', '尢', '酉', '訚', '以', '优', '宇文', '崖', '毓', '楊', '用', '渊', '亦', '樱', '腰', '邮', '圆', '赢', '耶', '盐', '艺', '夭', '嬴', '佑', '誉', '轧', '尉迟', '耀', '园', '因', '意', '咏', '演', '乐正', '邑', '葉', '亿', '楝', '羊舌', '鬱'])

 lastNameMap.set('Z', ['张', '赵', '周', '朱', '郑', '曾', '钟', '邹', '庄', '翟', '章', '祝', '左', '詹', '占', '卓', '臧', '甄', '仲', '植', '诸', '宗', '祖', '支', '湛', '訾', '昝', '竺', '战', '锺', '子', '终', '宰', '智', '扎', '展', '正', '自', '字', '泽', '招', '竹', '中', '资', '佐', '职', '仉', '禇', '郅', '禚', '肇', '昃', '纵', '志', '镇', '衷', '俎', '者', '主', '政', '增', '珠', '宗政', '真', '征', '传', '紫', '诸葛', '照', '只', '早', '壮', '迮', '知', '忠', '掌', '荘', '颛', '皱', '邾', '莊', '则', '钊', '糟', '治', '赞', '兆', '芷', '珍', '哲', '直', '曽', '昭', '張', '足', '柘', '振', '作', '再', '甑', '站', '载', '桌', '塚', '扎西', '旃', '遵', '绽', '趙', '踪', '追', '阵', '芝', '专', '州', '仲孙', '长孙', '住', '梓', '鈡', '孜', '尊', '针', '斋', '宰父', '颛孙', '找', '涨', '总', '陟', '子车', '闸', '暂', '沼', '转', '猪', '着', '枣', '姫', '左丘', '助', '在', '舟', '走', '杂', '庒', '窄', '畠', '彰', '纸', '贞', '寨', '乍', '咱', '奏', '执', '枝', '鄭', '坐', '震'])


 const data = [{ name: '阿霍' },{ name: '诸葛亮' },{ name: '阿三' },{ name: '陈坤' },{ name: '李四' },{ name: '陈大虾' },{ name: '成龙' },{ name: '孙策' },{ name: '王武' },{ name: '杜宇' },{ name: '张三' },{ name: '德明' },{ name: '公孙离' },{ name: '高亮' }]

 const size = lastNameMap.size

 const compoundSurnameList = ['爱新觉罗', '瓜尔佳氏', '赫舍里氏', '叶赫那拉', '欧阳', '太史', '端木', '上官', '司马', '东方', '独孤', '南宫', '万俟', '闻人', '夏侯', '诸葛', '尉迟', '公羊', '赫连', '澹台', '皇甫', '宗政', '濮阳', '公冶', '太叔', '申屠', '公孙', '慕容', '仲孙', '钟离', '长孙', '宇文', '司徒', '鲜于', '司空', '闾丘', '子车', '亓官', '司寇', '巫马', '公西', '颛孙', '壤驷', '公良', '漆雕', '乐正', '宰父', '谷梁', '拓跋', '夹谷', '轩辕', '令狐', '段干', '百里', '呼延', '东郭', '南门', '羊舌', '微生', '公户', '公玉', '公仪', '梁丘', '公仲', '公上', '公门', '公山', '公坚', '左丘', '公伯', '西门', '公祖', '第五', '公乘', '贯丘', '公皙', '南荣', '东里', '东宫', '仲长', '子书', '子桑', '即墨', '达奚', '褚师']

// 判断是否复姓
const isCompoundSurname = str => {
  const compoundSurnameStr = compoundSurnameList.join('|')
  const reg = new RegExp("^("+compoundSurnameStr+")[\u4e00-\u9fa5]+")
  return reg.test(str) ? str.replace(reg, (_, $1) => {
    console.log('_', _)
    console.log('$1', $1)
    return $1.length
  }) : 0
}

console.log(isCompoundSurname('爱新觉罗细叶'))

 const groupDataByLastName = arr => {
   let res = []
   for (const [key, value] of lastNameMap) {
    //  console.log('key=', key, ',value=' +value)
     const values = arr.filter(item => {
       let lastName
       if (isCompoundSurname(item.name)) {
         // 复姓
          lastName = item.name.substring(0, 2)
        } else {
          // 单姓
          lastName = item.name.charAt(0)
        }
        return value.includes(lastName)
      })
      res.push({ key, values })
   }
  //  console.log('res: ', res);
   return res
 }

// groupDataByLastName(data)
