// ==========================================================================================
// ============================== 前端安全相关 ===============================================
// ==========================================================================================


// ============================== CSRF 攻击 ==============================

// 1 跨站请求伪造: Cross-site request forgery
// a 劫持用户登录信息 cookie

// 2 解决方法
// a Token 验证: 服务端验证 Token 和 cookie 一致性
// b Referer 验证: 请求头验证来源
// c SameSite 配置: cookie 设置 SameSite


// ============================== XSS ==============================

// 1 跨站脚本: Cross Site Scripting
// a 在站点植入攻击脚本
// a-1 存储型: 攻击存储与服务端, 客户端请求的时候即会被攻击
// a-2 反射型: 攻击混入在 URL 的参数中, 服务端接收 URL 参数并存储返回到 HTML 中, 浏览器解析 HTML 即会被攻击
// a-3 DOM 型: 通过前端 Js 进行攻击，对用户的输入进行劫持修改，然后输出修改后的内容, 不用经过服务端

// 2 解决方法
// a 输入检查: 对的用户输入内容中的 iframe, script 标签进行转义或者过滤
// b 设置 HttpOnly: 禁止 js 脚本读取 cookie 内容
// c 开启 CSP: 白名单过滤
